src/DataProcessors/ДинамическоеФормированиеЗапроса/ДинамическоеФормированиеЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДинамическоеФормированиеЗапроса</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРезерве</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ДинамическоеФормированиеЗапроса/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Поехали(Команда)
	ПоехалиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоехалиНаСервере()
	ПолучитьДанныеДляТЧДокументыРеализации();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляТЧДокументыРеализации()
	
	Результат = Неопределено;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Запрос 1
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДАННЫЕ
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата < &Дата
	|	И РеализацияТоваровУслуг.Договор = &Договор
	|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДАННЫЕ.*
	|ИЗ
	|	ВТ_ДАННЫЕ КАК ВТ_ДАННЫЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	       
	// Запрос 2. Динамически формируем запрос для получения связанных документов
	Если Не РезультатЗапроса.Пустой() Тогда
		ЗапросСвязанныеДокуметы = Новый Запрос;
		ЗапросСвязанныеДокуметы.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросСвязанныеДокуметыМассив = Новый Массив;
		Счетчик = 1;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ИсходныйЗапросСвязанныеДокуметы = "ВЫБРАТЬ
			|СвязанныеДокументы.Ссылка КАК Ссылка,
			|&Значение" + Счетчик + " КАК ИсходныйДокумент"
			+ (?(Счетчик = 1, Символы.ПС + "ПОМЕСТИТЬ ВТ_СвязанныеДокументы", "")) + "
			|	ИЗ
			|КритерийОтбора.СвязанныеДокументы(&Значение%Счетчик%) КАК СвязанныеДокументы
			|	ГДЕ
			|ТипЗначения(СвязанныеДокументы.Ссылка) = ТИП(Документ.СчетФактураВыданный)";
			ЗапросСвязанныеДокуметыМассив.Добавить(СтрЗаменить(ИсходныйЗапросСвязанныеДокуметы, "%Счетчик%", Счетчик)); 
			ЗапросСвязанныеДокуметы.УстановитьПараметр("Значение" + Счетчик, Выборка.Ссылка);
			Счетчик = Счетчик + 1;
		КонецЦикла;
		ЗапросСвязанныеДокуметы.Текст = СтрСоединить(ЗапросСвязанныеДокуметыМассив, Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ " + Символы.ПС + Символы.ПС);
		ЗапросСвязанныеДокуметы.Текст = ЗапросСвязанныеДокуметы.Текст + ";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СвязанныеДокументы.*
		|ИЗ
		|	ВТ_СвязанныеДокументы КАК ВТ_СвязанныеДокументы";
		ЗапросСвязанныеДокуметы = ЗапросСвязанныеДокуметы.Выполнить();
		// Результат = ЗапросСвязанныеДокуметы.Выгрузить();
		
		// Запрос 3. Итоговый
		ЗапросИтоговый = Новый Запрос;
		ЗапросИтоговый.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросИтоговый.Текст = "ВЫБРАТЬ 
		|	Данные.*,
		|   ЕСТЬNULL(СвязанныеДокументы.Ссылка, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК СчетФактура
		|ИЗ ВТ_ДАННЫЕ КАК Данные
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязанныеДокументы КАК СвязанныеДокументы
		|	ПО (СвязанныеДокументы.ИсходныйДокумент = Данные.Ссылка)
		|";
	Иначе
		// Запрос 3. Итоговый
		ЗапросИтоговый = Новый Запрос;
		ЗапросИтоговый.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросИтоговый.Текст = "ВЫБРАТЬ 
		|	Данные.*,
		|   ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка) КАК СчетФактура
		|ИЗ ВТ_ДАННЫЕ КАК Данные
		|";
	КонецЕсли;
	
	РезультатЗапросаИтоговый = ЗапросИтоговый.Выполнить();
		
	Возврат Результат;
КонецФункции
